/* 
  Cloud.strings
  Sketch

  Created by Jelle De Laender on 12/02/16.
  Copyright © 2016 Bohemian Coding. All rights reserved.
*/

/*
 Server Replies
 
generic_title - General fallback, network issues, server completely down, ...
SERVER_ERROR - Generic server error, checking with Awkward
NOT_FOUND - Share Not Found when user want to update a share (wrong login, deleted, ...) - error isn't shown normally as Sketch uploads as new document
INVALID_PARAM - Error between Sketch & Server API version Or server is down/broken.
INVALID_TOKEN - Session of user is expired. User will be logged out.. We don't show a popup yet, but we should I think... (can be caused as the user resets the password somewhere...)
BANNED_FROM_SERVICE - User is banned/blocked from our service. Account is blocked
NOT_VERIFIED - User isn't verified and need to verify, is normally handled internally (no popup, but we should define one to be safe)
EMAIL_ALREADY_REGISTERED - User is creating account with email address that exist already
INVALID_EMAIL - User entered invalid email address. Sketch is doing some tests as well & user shouldn't get this error as Sketch wont allow user to submit invalid email.. but server should still validate it.
INVALID_PASSWORD - Invalid password when changing password. User need to type his current password, a mismatch causes this error
INVALID_LOGIN - Invalid credentials at login
INVALID_CODE - User typed wrong code when verifying account
IS_DELETED_title - User tries to update a deleted share (see NOT_FOUND)
INVALID_SIGNATURE - Error between Sketch & Server API version Or server is down/broken.
INVALID_USER  - Error between Sketch & Server API version Or server is down/broken.
 
 */

"cloudshare.error_generic_title" = "SketchCloud error.";
"cloudshare.error_SERVER_ERROR_title" = "There is a problem with our server.";
"cloudshare.error_EMAIL_NOT_FOUND_title" = "Your email address is not recognized.";
"cloudshare.error_SHARE_NOT_FOUND_title" = "Your upload cannot be found.";
"cloudshare.error_INVALID_PARAM_title" = "Cannot access SketchCloud server.";
"cloudshare.error_INVALID_TOKEN_title" = "Unable to access SketchCloud.";
"cloudshare.error_BANNED_FROM_SERVICE_title" = "Your SketchCloud account has been blocked.";
"cloudshare.error_NOT_VERIFIED_title" = "Account not yet verified.";
"cloudshare.error_EMAIL_ALREADY_REGISTERED_title" = "Cannot register with this email address.";
"cloudshare.error_INVALID_EMAIL_title" = "Please enter a valid email address.";
"cloudshare.error_INVALID_PASSWORD_title" = "Your password is incorrect.";
"cloudshare.error_INVALID_LOGIN_title" = "Your log in details are not recognized.";
"cloudshare.error_INVALID_CODE_title" = "Verification code not recognized.";
"cloudshare.error_IS_DELETED_title" = "Your upload cannot be found.";
"cloudshare.error_INVALID_SIGNATURE_title" = "Unable to access SketchCloud.";
"cloudshare.error_INVALID_USER_title" = "Unable to access SketchCloud.";


"cloudshare.error_generic_info" = "Something went wrong. Please try again later.";
"cloudshare.error_SERVER_ERROR_info" = "We could not connect to the SketchCloud server. Please try again later.";
"cloudshare.error_EMAIL_NOT_FOUND_info" = "We cannot find your email address on our server. Please check it and try again.";
"cloudshare.error_SHARE_NOT_FOUND_info" = "We were unable to find the document you have uploaded.";
"cloudshare.error_INVALID_PARAM_info" = "Sketch was unable to respond to the server. Please try again later.";
"cloudshare.error_INVALID_TOKEN_info" = "We are unable to access SketchCloud. Please log out, and sign in again.";
"cloudshare.error_BANNED_FROM_SERVICE_info" = "You are unable to access SketchCloud as your account has been blocked from our service.";
"cloudshare.error_NOT_VERIFIED_info" = "To use SketchCloud, you must first verify your account. Please check your emails from us for a 4 digit verification code.";
"cloudshare.error_EMAIL_ALREADY_REGISTERED_info" = "The email you are trying to register with has already been used to sign up for SketchCloud. Please use a different email address and try again.";
"cloudshare.error_INVALID_EMAIL_info" = "The email address you have entered is not a valid email address. Please check it, and try again.";
"cloudshare.error_INVALID_PASSWORD_info" = "Please ensure the current password you have entered is correct, and try again.";
"cloudshare.error_INVALID_LOGIN_info" = "Please make sure you have entered the correct email address and password, and try again.";
"cloudshare.error_INVALID_CODE_info" = "Please check the 4 digit verification code matches the one we have emailed you and try again.";
"cloudshare.error_IS_DELETED_info" = "We are unable to update your upload as it appears to have been removed from our server.";
"cloudshare.error_INVALID_SIGNATURE_info" = "Please make sure your version of Sketch is up to date, and try again.";
"cloudshare.error_INVALID_USER_info" = "Please make sure your version of Sketch is up to date, and try again.";

// Password changed
"cloudshare.password_changed_title" = "Your password has been updated.";
"cloudshare.password_changed_message" = "Your password has been successfully updated. You will need to log in again to any other devices running Sketch you were previously signed in on.";


"cloudshare.delete.account-title" = "Are you sure you want to delete the Sketch Online account for %@?";
"cloudshare.delete.account-delete" = "Delete";
"cloudshare.delete.account-cancel" = "Cancel";
"cloudshare.delete.account-text" = "Deleting your account will also remove all of your uploaded files. You cannot undo this action.";
